# Assignment on Store_sales dataset

**Load the Dataset**

In [3]:
import pandas as pd
df=pd.read_csv('store_sales.csv')
df.head()

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,S_1,Texas,8,20,13,21,17,20,24,17,16,9,7,6
1,S_2,California,12,19,15,15,11,19,7,15,10,11,21,19
2,S_3,California,16,16,14,19,23,6,13,13,15,14,24,8
3,S_4,Texas,8,18,13,10,14,14,6,8,8,18,7,11
4,S_5,Texas,19,5,24,9,5,24,10,5,24,15,6,13

**Calculate the total sales for each store across all months.**

In [13]:
df['total_sales']=df[['Jan','Feb','Mar','Apr','May','Jun','July','Aug','Sep','Oct',	'Nov','Dec']].sum(axis=1)
df.head()

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec,total_sales
0,S_1,Texas,8,20,13,21,17,20,24,17,16,9,7,6,178
1,S_2,California,12,19,15,15,11,19,7,15,10,11,21,19,174
2,S_3,California,16,16,14,19,23,6,13,13,15,14,24,8,181
3,S_4,Texas,8,18,13,10,14,14,6,8,8,18,7,11,135
4,S_5,Texas,19,5,24,9,5,24,10,5,24,15,6,13,159

**Find the average sales for each month across all stores**

In [79]:
average_sales = df.iloc[:, 2:14].mean()
average_sales

Jan     14.46
Feb     15.09
Mar     14.56
Apr     14.57
May     13.56
Jun     13.80
July    14.38
Aug     15.81
Sep     14.91
Oct     14.10
Nov     15.31
Dec     13.57
dtype: float64

**Identify the store with the highest total sales.**

In [31]:
max_sale=df[df['total_sales'] == df['total_sales'].max()]
max_sale

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec,total_sales
61,S_62,California,16,21,6,22,22,9,21,21,22,17,16,21,214
85,S_86,California,15,23,24,18,21,17,23,13,12,11,24,13,214

**Calculate the total sales for each city.**

In [37]:
total_city_sales=df.groupby('city')['total_sales'].sum()
total_city_sales

city
Arizona       3951
California    7522
Texas         5939
Name: total_sales, dtype: int64

**List stores with total sales greater than 200**

In [63]:
total=df.groupby('store_id')['total_sales'].sum()
ts=total[total>200]
ts

store_id
S_38    207
S_40    204
S_51    210
S_62    214
S_70    206
S_73    213
S_78    211
S_86    214
S_87    203
S_93    204
Name: total_sales, dtype: int64

**Which month had the highest average sales across all stores?**

In [83]:
month= average_sales.idxmax()
highest_value = average_sales.max()
print("month:",month)
print('value: ',highest_value)

month: Aug
value:  15.81

**Which city generated the most revenue?**

In [85]:
more_revenue=total_city_sales.max()
print('city:',total_city_sales.idxmax())
print('value: ',more_revenue)

city: California
value:  7522